//
//  YoViewController.swift
//  nyann
//
//  Created by 實森翔 on 2018/10/31.
//  Copyright © 2018年 hogehoge. All rights reserved.
//

import UIKit

class YoViewController: UIViewController ,UITableViewDelegate, UITableViewDataSource{
    var MenuArray = [["牛丼","0"],["牛丼(並)","380"],["牛丼(アタマの大盛り)","480"],["牛丼(大)","550"],["牛丼(特)","680"],
                     ["牛ねぎ玉丼(並)","480"],["牛ねぎ玉丼(アタマの大盛り)","580"],["牛ねぎ玉丼(大)","650"],["牛ねぎ玉丼(特)","780"],["サラシア牛丼","480"],
                     ["新味豚丼","0"],["新味豚丼(並)","350"],["新味豚丼(アタマの大盛り)","450"],["新味豚丼(大)","520"],["新味豚丼(特)","650"],
                     ["豚生姜丼(並)","490"],["豚生姜丼(アタマの大盛り)","590"],["豚生姜丼(大)","660"],["豚生姜丼(特)","790"],
                     ["豚キムチ丼(並)","450"],["豚キムチ丼(アタマの大盛り)","550"],["豚キムチ丼(大)","620"],["豚キムチ丼(特)","750"],
                     ["豚ねぎ玉丼(並)","450"],["豚ねぎ玉丼(アタマの大盛り)","550"],["豚ねぎ玉丼(大)","620"],["豚ねぎ玉丼(特)","750"],
                     ["豚半玉丼(並)","420"],["豚半玉丼(アタマの大盛り)","520"],["豚半玉丼(大)","590"],["豚半玉丼(特)","720"],
                     ["定食","0"],["豚生姜定食(並)","550"],["豚生姜定食(大)","720"],["豚生姜定食(特)","850"],["ご飯の大盛り","+30"],
                     ["牛鮭定食(並)","580"],["牛鮭定食(ご飯大盛り)","610"],["豚鮭定食(並)","550"],["豚鮭定食(ご飯大盛り)","580"],
                     ["麦とろ","0"],["麦とろ牛皿御膳(並)","590"],["麦とろ牛皿御膳(大)","690"],["麦とろ鰻皿御膳(並)","890"],["麦とろサラ牛御膳(並)","690"],["麦とろサラ牛御膳(大)","790"],
                     ["納豆定食(並)","360"],["納豆定食(ご飯大盛)","390"],["焼魚定食(並)","450"],["焼魚定食(ご飯大盛)","480"],["得朝定食(並)","550"],["得朝定食(ご飯大盛)","580"],
                     ["納豆牛小鉢定食(並)","450"],["納豆牛小鉢定食(ご飯大盛)","480"],["焼魚牛小鉢定食(並)","590"],["焼魚牛小鉢定食(ご飯大盛り)","620"],
                     ["鰻重","0"],["鰻丼小鉢セット(1枚盛り)","930"],["鰻丼小鉢セット(2枚盛り)","1330"],["鰻丼小鉢セット(3枚盛り)","1830"],["鰻重(1枚盛り)","790"],["鰻重(2枚盛り)","1190"],["鰻重(3枚盛り)","1690"],["鰻皿(1枚盛り)","690"],["鰻皿(2枚盛り)","1090"],["鰻皿(3枚盛り)","1590"],
                     ["牛丼小盛り&サラダセット コモサラ","0"],["コモサラ(生野菜サラダ)","400"],["サラダ変更(ごぼうサラダorポテトサラダ)","30"],
                     ["黒カレー","0"],["牛黒カレー(並)","550"],["牛黒カレー(大)","650"],["黒カレー(並)","350"],["黒カレー(大)","450"],["チーズ黒カレー(並)","450"],["チーズ黒カレー(大)","550"],
                     ["半熟卵×チーズ(並)","520"],["半熟卵×チーズ(大)","620"],["牛×半熟卵(並)","620"],["牛×半熟卵","720"],["半熟卵黒カレー(並)","420"],["半熟卵黒カレー(大)","520"],["牛×チーズ(並)","650"],["牛×チーズ(大)","750"],
                     ["サイドメニュー","0"],["とん汁","190"],["しじみ汁","160"],["生野菜サラダ","100"],["とろろ","200"],["みそ汁","60"],["ごぼうサラダ","130"],["ポテトサラダ","130"],["キムチ","100"],["チーズ","100"],["玉子","60"],["ねぎ玉子","100"],["半熟卵","70"],["鮭","200"],["納豆","80"],["のり","60"],["ごはん","140"],["追加マヨネーズ/ドレッシング","20"],
                     ["牛小皿","170"],["牛皿(並)","330"],["牛皿(大)","450"],["牛皿(特)","580"],["豚皿(並)","300"],["豚皿(大)","420"],["豚皿(特)","550"],["豚生姜皿(並)","440"],["豚生姜皿(大)","560"],["豚生姜皿(特)","690"],
        ["学割おすすめメニュー","0"],["牛丼 頭の大盛みそ汁セット","500"],["牛丼 頭の大盛サラダセット","550"],["牛丼 大盛玉子みそ汁セット(学割大盛)","600"],["カレー 大盛サラダみそ汁セット","550"],["牛カレー 大盛サラダセット","650"]]
    func tableView(_ tableView: UITableView, numberOfRowsInSection section: Int) -> Int {
        return MenuArray.count
    }
    
    func tableView(_ tableView: UITableView, cellForRowAt indexPath: IndexPath) -> UITableViewCell {
        let cell: UITableViewCell = tableView.dequeueReusableCell(withIdentifier: "yoshicell", for: indexPath)
        
        // セルに表示する値を設定する
        cell.textLabel!.text = MenuArray[indexPath.row][0]
        if(MenuArray[indexPath.row][1]=="0"){
            cell.detailTextLabel?.text = ""
        }else{
            cell.detailTextLabel?.text = MenuArray[indexPath.row][1]+"yen"
        }
        return cell
    }
    
    override func viewDidLoad() {
        super.viewDidLoad()
        self.navigationItem.title = "吉野家"
        // Do any additional setup after loading the view, typically from a nib.
    }
    
    override func didReceiveMemoryWarning() {
        super.didReceiveMemoryWarning()
        // Dispose of any resources that can be recreated.
    }
    
}
